In [2]:
import numpy as np
import pandas as pd

In [4]:
dict1={"Treepop":90,"john":99,'Smith':85}

In [5]:
dict1

{'Treepop': 90, 'john': 99, 'Smith': 85}

In [7]:
pd.Series(dict1)

Treepop    90
john       99
Smith      85
dtype: int64

In [8]:
score=[90,99,85]
Name = ["Threepop","josh","smith"]

In [9]:
series = pd.Series(data=score, index=Name)
print(series)

Threepop    90
josh        99
smith       85
dtype: int64

In [10]:
print(type(score))
print(type(Name))

<class 'list'>
<class 'list'>

In [11]:
Score2 = np.array(score)
Name2 = np.array(Name)
print(Score2)
print(Name2)

[90 99 85]
['Threepop' 'josh' 'smith']

In [12]:
print(type(Score2))
print(type(Name2))

<class 'numpy.ndarray'>
<class 'numpy.ndarray'>

In [14]:
series2 = pd.Series(data=Score2,index=Name2)
print(series2)

Threepop    90
josh        99
smith       85
dtype: int64

In [125]:
# โหลด csv เข้าไปใน Python Pandas
df = pd.read_csv('train.csv')
# 2. เขียนโค้ดแสดง หัว10แถว ท้าย10แถว และสุ่ม10แถว
df.head(10)
df.tail(10)
df.sample(10)
# 3. ลบ row ที่มี Embarked ว่าง
df.dropna()
# 4. เติม age ด้วยค่าเฉลี่ย
avg = df['Age'].mean()
df['Age'].fillna(value=avg)
# 5. เติม age ด้วย 0
df['Age'].fillna(value=0)
# ลบ row ที่ age เป็นค่าว่าง
df['Age'].dropna()
# 7. หาจำนวนผู้หญิงต่อผู้ชายที่อยู่บนเรือ
male = df['Sex'].value_counts()['male']
female = df['Sex'].value_counts()['female']
female/male
# 8. หาจำนวนผู้หญิงและผู้ชายที่รอดชีวิต
df2 = df[['Sex','Survived']]
df3 = df2['Survived'] == 1
df4 = df2[df3]
male = df4['Sex'].value_counts()['male']
female = df4['Sex'].value_counts()['female']
print(male)
print(female)
# 9. หา % การรอดชีวิตของผู้หญิงและผู้ชาย
total = len(df.index)
male/total*100
female/total*100
# 10. แปลงคอลัมน์ female = 0 และ male = 1
df['Sex'].apply(lambda sex:1 if sex=='male' else 0)
# หาคนที่อายุมากที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน
df[df['Age'] == df['Age'].max()][['Name','Age','Embarked']]
# 12. หาคนที่อายุน้อยที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน
df[df['Age'] == df['Age'].min()][['Name','Age','Embarked']]
# 13. หาคนที่จ่ายค่าโดยสารแพงที่สุดพร้อมบอกชื่อ อายุ และ
# รอดชีวิตไหม
df[df['Fare'] == df['Fare'].max()][['Name','Age','Survived']]
# 14. หาคนที่จ่ายค่าโดยสารถูกที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิต
# ไหม
df[df['Fare'] == df['Fare'].min()][['Name','Age','Survived']]
# 15. สรุปว่ามีคนนั่งตั๋ว 1 2 3 กี่คน
print(df['Pclass'].value_counts()[1])
print(df['Pclass'].value_counts()[2])
print(df['Pclass'].value_counts()[3])
# หาค่าเฉลี่ยของตั๋วโดยสารแบบที่นั่งชั้น 1 2 3
df[df['Pclass'] == 1]['Fare'].mean()
df[df['Pclass'] == 2]['Fare'].mean()
df[df['Pclass'] == 3]['Fare'].mean()
# 17. มีผู้โดยสารกี่คนที่อายุเกิน 50 แล้วรอดชีวิต
sr_survived = df['Survived'] == 1
sr_age_greater_50 = df['Age'] > 50
df_survived_and_age_greater_50 = df[sr_survived & sr_age_greater_50]
len(df_survived_and_age_greater_50.index)
# 18. แสดงผลข้อมูลทั้งหมดของที่นั่งชั้น 1 2 3 (describe)
sr_first_class = df[df['Pclass'] == 1]
sr_second_class = df[df['Pclass'] == 2]
sr_third_class = df[df['Pclass'] == 3]

# 19. แสดงผลตั๋วที่แพงที่สุดของที่นั่งแต่ละชั้น

# 20. แสดงเป็นกลุ่มช่วงอายุ 0-10, 20-30 …. (เพิ่มทีละ10) และหา
# ว่าแต่ละกลุ่มมีอัตราการรอดชีวิตเท่าไหร่

# เรียงลำดับตามราคามากไปน้อย และน้อยไปมาก

109
233
216
184
491

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C